<?php

function getPaymentDates(array $data, $exclude = 2)
{
  $begin = new DateTime($data['effectivedate']);
  $period = new DatePeriod(
    $begin,
    new DateInterval('P1M'),
    (int) $data['duration']
  );

  $clean = array();
  $last = (int) $begin->format('m');

  foreach ($period as $date) {
    while ($last != $date->format('m')) {
      $date->modify('-1 day');
    }

    $clean[] = $date;
    if (++$last > 12) {
      $last = 1;
    }
  }

  if ($exclude === 2) {
    array_pop($clean);
  }

  return $clean;
}

// $replaceVars = array(
//   'effectivedate' => date('d-m-Y'),
//   'vatpc'         => 0.15,
//   'paymentamount' => 150.00,
//   'duration'      => 6
// );

// $dates = getPaymentDates($replaceVars, 2); // Exclude the final date

// // Calculate the payment value upfront
// $payment = round($replaceVars['paymentamount'] + $replaceVars['paymentamount'] * $replaceVars['vatpc'], 2);

// $pay = array(); // Initialize an empty array to store the payment dates

// foreach ($dates as $i => $date) {
//   $pay[$i+1] = $date->format('d-m-Y'); // Save the payment date in the desired format
// }


?>
<?php
require_once('tcpdf/tcpdf.php');
include_once('config/database.php');
// Fetch the data based on the ID from the database or any other method
$data = $_POST;
$name = $data['name'];
$Day = $data['Day'];
$Dayl = $data['Dayl'];
$Card = $data['Card'];
$Birth = $data['Birth'];
$Name = $data['Name'];
$Lname = $data['Lname'];
$pay1 = $data['myCheckbox'];
$Num = $data['Num'];
$money = intval($data['money'] ?? 0);
$first = intval($data['first'] ?? 0);
$round = !empty($data['round']) ? intval($data['round']) : intval($data['numberInput']);
$percent = intval($data['firstp'] ?? 0);
$action = intval($data['action'] ?? 0);
$phone = $data['phone'];
$program = $data['program'];
$callback = $data['callback'];
$message = $data['message'];
$imageData = $data['signature'];
$fee = $data['fee'] ?? 300 ;

$replaceVars = array(
  'effectivedate' => date('d-m-Y'),
  'vatpc'         => 0.15,
  'paymentamount' => 150.00,
  'duration'      => $round
);

$dates = getPaymentDates($replaceVars, 2); // Exclude the final date

// Create an array to store the payment dates
$paymentDates = array();

// Calculate the payment value upfront
$payment = round($replaceVars['paymentamount'] + $replaceVars['paymentamount'] * $replaceVars['vatpc'], 2);

// Store the payment dates in the array
foreach ($dates as $i => $date) {
  $formattedDate = $date->format('d F Y');
  $thaiDate = convertToThaiDate($formattedDate);
  $paymentDates[$i] = $thaiDate;
}

// Function to convert date to Thai format
function convertToThaiDate($date)
{
  $dateTime = DateTime::createFromFormat('d F Y', $date);
  $thaiMonths = array(
    'มกราคม', 'กุมภาพันธ์', 'มีนาคม', 'เมษายน', 'พฤษภาคม', 'มิถุนายน',
    'กรกฎาคม', 'สิงหาคม', 'กันยายน', 'ตุลาคม', 'พฤศจิกายน', 'ธันวาคม'
  );
  $thaiYear = $dateTime->format('Y') + 543;
  $thaiMonth = $thaiMonths[$dateTime->format('n') - 1];
  $thaiDay = $dateTime->format('d');
  return $thaiDay . ' ' . $thaiMonth . ' ' . $thaiYear;
}



$customInstallments = [];
for ($i = 1; $i <= $round; $i++) {
  if (isset($data['installmentField' . $i])) {
    $customInstallments[] = intval($data['installmentField' . $i] ?? 0);
  }
}

// Function to decode base64 image data and save it as a file
function saveBase64ImageToFile($base64Image, $filePath)
{
  // Remove the data URI part from the string
  $base64Image = str_replace('data:image/png;base64,', '', $base64Image);

  // Decode the base64 image data and save it as a file
  file_put_contents($filePath, base64_decode($base64Image));
}

// Create a new PDF instance
define('THSarabunNew', TCPDF_FONTS::addTTFfont(dirname(__FILE__) . '/tcpdf/fonts/THSarabunNew.ttf', 'TrueTypeUnicode'));
define('THSarabunNewBold', TCPDF_FONTS::addTTFfont(dirname(__FILE__) . '/tcpdf/fonts/THSarabunNew-Bold.ttf', 'TrueTypeUnicode'));

$pdf = new TCPDF('P', PDF_UNIT, PDF_PAGE_FORMAT, true, 'UTF-8', false);

// Set document information
$pdf->SetCreator('Your Name');
$pdf->SetAuthor('Your Name');
$pdf->SetTitle('Employment Contract');
$pdf->SetSubject('Contract Details');

// Add a new page
$pdf->SetPrintHeader(false);
$pdf->SetPrintFooter(false);
$pdf->AddPage();
// Set font and font size
$pdf->SetXY(0, 20);
$pdf->SetFont(THSarabunNewBold, '', 16);
$pdf->Cell(0, 0, 'ใบคำขอสินเชื่อค่าเบี้ยประกันภัย', 0, 1, 'C');
$pdf->Ln(7);

$pdf->SetFont(THSarabunNew, '', 14);
$pdf->SetXY(10, 30);
$pdf->Cell(0, 7, 'วันที่เขียน :' . $Day . '   วันที่คุ้มครอง :' . $Dayl . '     ทะเบียนรถยนต์ : ' . $Num, 0, 1);

$pdf->Cell(0, 7, 'ข้าพเจ้า "ผู้เอาประกัน"  ชื่อ-สกุล (นาย/นาง/นางสาว): ' . $Name . ' ' . $Lname, 0, 1);

$pdf->Cell(0, 7, 'บัตรประชาชนเลขที่ : '. $Card , 0, 1);

$pdf->Cell(0, 7, 'ที่อยู่ปัจจุบัน : ' . $message, 0, 1);

$pdf->Cell(0, 7, 'เบอร์โทรติดต่อ : ' . $phone, 0, 1);

$pdf->Cell(0, 7, 'สถานที่จัดส่งเอกสาร: ' . $callback, 0, 1);

$pdf->Cell(0, 7, 'ที่อยู่อื่น : ', 0, 1);

$pdf->Cell(10, 7, 'ผลิตภัณฑ์ประกันรถยนต์ที่ขอผ่อน :', 0, 1);

$pdf->Cell(10, 7, $program . '    ' . $callback . '  จำนวนเงิน   ' . $money . '  บาท', 0, 'J');

// $pdf->Cell(10, 8, 'พรบ.รถยนต์ 3 '.$callback.'   จำนวนเงิน    '.$Num.'  บาท', 0, 'J');

$pdf->Cell(10, 7, 'รวมจำนวนเงินค่าเบี้ยประกันภัยที่ขอผ่อน    ' . $money . '   บาท', 0, 'J');

if ($action == 1) {
  $pdf->Cell(10, 7, 'ค่าธรรมเนียมผ่อน'   .$fee.   'บาท', 0, 'J');
  $pdf->Cell(10, 7, 'รวม  ค่าเบี้ยประกัน + ค่าธรรมเนียม   ' . ($money + $fee) . '   บาท  ขอผ่อนชำระทั้งหมด   ' . $round . '     งวด', 0, 'J');
  $pdf->Cell(10, 7, 'ชำระงวดแรก เป็นจำนวนเงิน    ' . $first . '   บาท  คงเหลืองวดที่ต้องชำระ  ' . ($round - 1) . '   งวด   ', 0, 'J');
  for ($i = 2; $i <= $round; $i++) {
    $installment = ceil(($money + $fee - $first) / ($round - 1));
    $formattedDate = isset($paymentDates[$i - 1]) ? $paymentDates[$i - 1] : '';
    $pdf->Cell(10, 7, 'ชำระงวดที่ ' . $i . ' เป็นจำนวนเงิน    ' . $installment . '   บาท  ชำระไม่เกินวันที่   ' . $formattedDate, 0, 'J');
  }
} else if ($action == 2) {

  $pdf->Cell(10, 7, 'ค่าธรรมเนียมผ่อน'   .$fee.   'บาท', 0, 'J');
  $pdf->Cell(10, 7, 'รวม  ค่าเบี้ยประกัน + ค่าธรรมเนียม   ' . ($money + $fee) . '   บาท  ขอผ่อนชำระทั้งหมด   ' . $round . '     งวด', 0, 'J');
  for ($i = 0; $i <= $round - 1; $i++) {
    $installment = ceil(($money + $fee) / $round);
    $formattedDate = isset($paymentDates[$i]) ? $paymentDates[$i] : '';
    $pdf->Cell(10, 7, 'ชำระงวดที่ ' . $i + 1 . ' เป็นจำนวนเงิน    ' . $installment . '   บาท  ชำระไม่เกินวันที่   ' . $formattedDate, 0, 'J');
  }
} else if ($action == 3) {

  $per = (intval($money)+$fee) * $percent / 100;
  $pdf->Cell(10, 7, 'ค่าธรรมเนียมผ่อน'   .$fee.   'บาท', 0, 'J');
  $pdf->Cell(10, 7, 'รวม  ค่าเบี้ยประกัน + ค่าธรรมเนียม   ' . ($money + $fee) . '   บาท  ขอผ่อนชำระทั้งหมด   ' . $round . '     งวด', 0, 'J');
  $first = $per;
  $pdf->Cell(10, 7, 'ชำระงวดแรก เป็นจำนวนเงิน    ' . $first . '   บาท  คงเหลืองวดที่ต้องชำระ  ' . ($round - 1) . '   งวด   ', 0, 'J');
  for ($i = 2; $i <= $round; $i++) {
    $installment = ceil(($money + $fee - $first) / ($round - 1));
    $formattedDate = isset($paymentDates[$i - 1]) ? $paymentDates[$i - 1] : '';
    $pdf->Cell(10, 7, 'ชำระงวดที่ ' . $i . ' เป็นจำนวนเงิน    ' . $installment . '   บาท  ชำระไม่เกินวันที่   ' . $formattedDate, 0, 'J');
  }
} else if ($action == 4) {
  $pdf->Cell(10, 7, 'ค่าธรรมเนียมผ่อน'   .$fee.   'บาท', 0, 'J');
  $pdf->Cell(10, 7, 'รวม  ค่าเบี้ยประกัน + ค่าธรรมเนียม   ' . ($money + $fee) . '   บาท  ขอผ่อนชำระทั้งหมด   ' . $round . '     งวด', 0, 'J');

  // Ensure $customInstallments array is not empty before accessing its values
  if (!empty($customInstallments)) {
    for ($i = 0; $i < $round; $i++) {
      $installment = $customInstallments[$i] ?? 0; // Use the null coalescing operator to handle undefined keys
      $formattedDate = isset($paymentDates[$i]) ? $paymentDates[$i] : '';
      $pdf->Cell(10, 7, 'ชำระงวดที่ ' . ($i + 1) . ' เป็นจำนวนเงิน    ' . $installment . '   บาท  ชำระไม่เกินวันที่   ' . $formattedDate, 0, 'J');
    }
  }
} else if ($action == 5) {
  $pdf->Cell(10, 7, 'ค่าธรรมเนียมผ่อน'   .$fee.   'บาท', 0, 'J');
  $pdf->Cell(10, 7, 'รวม  ค่าเบี้ยประกัน + ค่าธรรมเนียม   ' . ($money + $fee) . '   บาท  ขอผ่อนชำระทั้งหมด   ' . $round . '     งวด', 0, 'J');

  // Ensure $customInstallments array is not empty before accessing its values
  if (!empty($customInstallments)) {
    for ($i = 0; $i < $round; $i++) {
      $formattedDate = isset($paymentDates[$i]) ? $paymentDates[$i] : '';
      $installment = $customInstallments[$i] ?? 0; // Use the null coalescing operator to handle undefined keys
      $pdf->Cell(10, 7, 'ชำระงวดที่ ' . ($i + 1) . ' เป็นจำนวนเงิน    ' . $installment . '   บาท  ชำระไม่เกินวันที่   ' . $formattedDate, 0, 'J');
    }
  }
}

$pdf->Cell(10, 7, 'ข้าพเจ้า (ซึ่งต่อไปนี้จะเรียกว่า "ผู้กู้") มีความประสงค์จะกู้เงินจาก นางสาว กุลิสรา วงษ์เทศ (ซึ่งต่อไปนี้จะเรียกว่า "ผู้ให้กู้") เพื่อนำไปชำระค่าเบี้ยประกันภัย', 0, 'J');
$pdf->Cell(10, 7, 'ตามรายละเอียดที่ระบุไว้ข้างต้น โดยผู้กู้ตกลงปฏิบัติตามเงื่อนไขและข้อกำหนดการให้สินเชื่อค่าเบี้ยประกันที่ระบุไว้ตามสัญญานี้ รวมถึงเอกสาร', 0, 'J');
$pdf->Cell(10, 7, 'แนบท้ายสัญญา ทุกประการ  หากผู้กู้ไม่ปฏิบัติตามหรือประพฤติผิดเงื่อนไขหรือข้อกำหนดต่าง ๆ ผู้กู้ตกลงยินยอมให้สิทธิอย่างเต็มที่ทุกประการแก่ผู้ให้กู้', 0, 'J');
$pdf->Cell(10, 7, 'รวมถึงบุคคลอื่นใดที่เกี่ยวข้อง หรือรับมอบอำนาจจากผู้ให้กู้ในอันที่จะยกเลิก หรือถอนกรมธรรม์ของผู้กู้ได้ทันที โดยผู้กู้ยินยอมสละข้อต่อสู้ทั้งหมดที่', 0, 'J');
$pdf->Cell(10, 7, 'ผู้กู้พึงมีและจะไม่เรียกร้องหรือเอาความอย่างใด กับผู้ให้กู้รวมถึงบุคคลอื่นใดด้วย  เพื่อเป็นหลักฐานแห่งการนี้ ผู้กู้จึงได้ลงนามไว้เป็นสำคัญ', 0, 'J');
$pdf->Ln(6);
$pdf->Cell(10, 7, 'ลายมือชื่อผู้ขอสินเชื่อ / ผู้กู้'  . '   ________________________________    วันที่     ' . $pay1, 0, 'J');


// Save the base64 image as a file
$signaturePath = 'upload/signature.png'; // Specify the path where you want to save the signature image
if (!empty($imageData)) {
  $signaturePath = 'upload/signature.png';
  saveBase64ImageToFile($imageData, $signaturePath);
} else {
  // Use the blank photo as the signature image if $imageData is empty
  $signaturePath = 'upload/blank.png';
}

// Print the image under the Signature cell
$imageWidth = 50; // Specify the desired image width in mm
$imageHeight = 10; // Specify the desired image height in mm
$pdf->Image($signaturePath, 55, 149 + ($round * 7), $imageWidth, $imageHeight, 'PNG');
$pdf->Cell(10, 7, '                                            ('  . $Name . ' ' . $Lname . ')', 0, 'J');
$pdf->SetFont(THSarabunNewBold, '', 15);
$pdf->Cell(10, 7, 'การชำระค่างวด การคิดค่าปรับล้าช้า และ การยกเลิกกรมธรรม์ :', 0, 'J');
$pdf->SetFont(THSarabunNew, '', 14);
$pdf->Cell(10, 7, ' - หากผู้เอาประกันหรือผู้กู้ ผิดนัดชำระจากวันที่กำหนด  ผู้ให้กู้ขอสงวนสิทธิ์ในการเรียกเก็บค่าปรับล่าช้า 200 บาท / งวด / ครั้ง', 0, 'J');
$pdf->Cell(10, 7, '  - หากผู้เอาประกันหรือผู้กู้ ผิดนัดชำระเกิน 7 วันจากวันที่กำหนด  ผู้ให้กู้ขอสงวนสิทธิ์ในการยกเลิกกรมธรรม์โดยมิต้องแจ้งให้ทราบล่วงหน้า', 0, 'J');

$pdf->AddPage();
// Set font and font size
$pdf->SetXY(0, 20);
$pdf->SetFont(THSarabunNewBold, '', 16);
$pdf->Cell(0, 0, 'สัญญาขอสินเชื่อค่าเบี้ยประกันภัย', 0, 1, 'C');
$pdf->Ln(10);

$pdf->SetFont(THSarabunNew, '', 13);
$pdf->SetXY(10, 30);
$pdf->Cell(0, 8, 'ข้าพเจ้า ' . $Name . ' ' . $Lname . '    (ผู้กู้)  เป็นผู้เอาประกันภัยรถยนต์ทะเบียน  :' . $Num, 0, 1);

$pdf->Cell(0, 8, 'ซึ่งขอทำประกันภัยไว้กับ ' . $callback . '   ผ่านตัวแทน/นายหน้า นางสาว กุลิสรา  วงษ์เทศ', 0, 1);

$pdf->MultiCell(190, 8, 'ขอเข้าทำสัญญากับ นางสาว กุลิสรา  วงษ์เทศ ("ผู้ให้กู้")  ในการขอรับสินเชื่อค่าเบี้ยประกันภัยที่ระบุไว้บนกรมธรรม์ประกันภัยรวมถึงเอกสารแนบท้ายสัญญาประกันภัยด้วย  โดยข้าพเจ้าขอให้คำยืนยัน ต่อผู้ให้กู้ว่าจะปฏิบัติและยินยอมผูกพันตามข้อกำหนดและเงื่อนไขของสัญญาขอสินเชื่อค่าเบี้ยประกันภัยโดยมีรายละเอียดดังต่อไปนี้', '0', 'L', false);

$pdf->Cell(0, 8, '1. ผู้กู้สัญญาว่า ', 0, 1);

// $pdf->MultiCell(190,10,'1.1) ผู้กู้มีหน้าที่ตรวจสอบความถูกต้องของกรมธรรม์ประกันภัยและเอกสารแนบท้ายสัญญาประกันต่างๆหากมีความผิดพลาดประการใดเกี่ยวกับกรมธรรม์ประกันภัยหรือเอกสารแนบท้ายสัญญาประกันภัยจนอาจเป็นผลทำให้ผู้รับประกันภัยปฏิเสธการเรียกร้องค่าสินไหมทดแทนไม่ว่าด้วยสาเหตุประกาศใดให้ถือว่าเป็นความรับผิดชอบของผู้กู้โดยยินยอมรับผิดชอบความเสียหายนั่นเองเป็นการเฉพาะตัว','0','L',false);
$pdf->Cell(10, 8, '1.1) ผู้กู้มีหน้าที่ตรวจสอบความถูกต้องของกรมธรรม์ประกันภัยและเอกสารแนบท้ายสัญญาประกันต่าง ๆ หากมีความผิดพลาดประการใดเกี่ยวกับ ', 0, 1);
$pdf->Cell(10, 8, 'กรมธรรม์ประกันภัยหรือเอกสารแนบท้ายสัญญาประกันภัยจนอาจเป็นผลทำให้ผู้รับประกันภัยปฏิเสธการเรียกร้องค่าสินไหมทดแทนไม่ว่าด้วยสาเหตุ', 0, 1);
$pdf->Cell(10, 8, ' ประกาศใด ให้ถือว่าเป็นความรับผิดชอบของผู้กู้  โดยยินยอมรับผิดชอบความเสียหายนั่นเอง เป็นการเฉพาะตัว', 0, 1);
// $pdf->MultiCell(190,10,'1.2) หากผู้กู้มีการแจ้งเคลมสินไหมเกิดขึ้นผู้กู้ตกลงว่าผู้กู้มีหน้าที่ต้องชำระค่าเบี้ยประกันภัยที่ยังคงค้างอยู่รวมถึงค่าเบี้ยประกันภัยในงวดถัดไปให้กับผู้ให้กู้ทันทีทั้งนี้หากผู้กู้เพิกเฉยไม่ปฏิบัติตาม ','0','L',false);
$pdf->Cell(10, 8, '1.2) หากผู้กู้มีการแจ้งเคลมสินไหมเกิดขึ้น  ผู้กู้ตกลงว่าผู้กู้มีหน้าที่ต้องชำระค่าเบี้ยประกันภัยที่ยังคงค้างอยู่รวมถึงค่าเบี้ยประกันภัยในงวดถัดไปให้', 0, 1);
$pdf->Cell(10, 8, 'กับผู้ให้กู้ทันที  ทั้งนี้หากผู้กู้เพิกเฉยไม่ปฏิบัติตาม', 0, 1);

$pdf->Cell(10, 8, '1.3) หากมีการแจ้งเปลี่ยนแปลงใดๆ ในกรมธรรม์ประกันภัย ผู้กู้มีหน้าที่ต้องแจ้งการเปลี่ยนแปลงดังกล่าวแก่ผู้ให้กู้ทันที', 0, 1);

$pdf->Cell(10, 8, '1.4) ผู้กู้ยอมเข้าผูกพันตนว่าจะไม่ยกเลิกกรมธรรม์ประกันภัยตามสัญญานี้  หรือจะไม่ทำการมอบให้  โอน  จำนำ  ค้ำประกันโดยมิได้รับความยินยอม', 0, 1);
$pdf->Cell(10, 8, 'เป็นลายลักษณ์อักษรจากผู้ให้กู้', 0, 1);

// $pdf->MultiCell(190,10,'1.5) หากทรัพย์สินที่เอาประกันภัยเกิดความเสียหายสิ้นเชิงหรือเสียหายเสมือนสิ้นเชิง ซึ่งส่งผลให้กรมธรรม์ประกันภัยยกเลิกหรือสิ้นสุด ผู้กู้ตกลงว่าผู้กู้จะชำระค่าเบี้ยประกันภัยทั้งหมดให้กับผู้ให้กู้ทันที ไม่ว่าค่าเบี้ยประกันภัยในแต่ละงวดจะถึงกำหนดชำระแล้วหรือไม่','0','L',false);
$pdf->Cell(10, 8, '1.5) หากทรัพย์สินที่เอาประกันภัยเกิดความเสียหายสิ้นเชิงหรือเสียหายเสมือนสิ้นเชิง ซึ่งส่งผลให้กรมธรรม์ประกันภัยยกเลิกหรือสิ้นสุด', 0, 1);

$pdf->Cell(10, 8, 'ผู้กู้ตกลงว่าผู้กู้จะชำระค่าเบี้ยประกันภัยทั้งหมดให้กับผู้ให้กู้ทันที ไม่ว่าค่าเบี้ยประกันภัยในแต่ละงวดจะถึงกำหนดชำระแล้วหรือไม่', 0, 1);

$pdf->MultiCell(190, 8, '1.6) ผู้กู้จะต้องรับผิดชอบในจำนวนเงินกู้ทั้งหมดที่ได้รับจากผู้ให้กู้ไปแล้วโดยตัวของผู้กู้เองหรือโดยนายหน้าประกันภัย หรือตัวแทนประกันภัย ผู้กู้ทราบดีว่าการกระทำใดๆ ของผู้ให้กู้ นายหน้าประกันภัย หรือตัวแทนประกันภัยจะไม่เป็นการผ่อนผันหรือทำให้ผู้กู้พ้นจากความรับผิดชอบดังกล่าว', '0', 'L', false);
// $pdf->Cell(10, 7, '1.6) ผู้กู้จะต้องรับผิดชอบในจำนวนเงินกู้ทั้งหมดที่ได้รับจากผู้ให้กู้ไปแล้วโดยตัวของผู้กู้เองหรือโดยนายหน้าประกันภัย หรือตัวแทนประกันภัย ผู้กู้ทราบดีว่าการกระทำใดๆ ของผู้ให้กู้ นายหน้าประกันภัย' , 0, 1);

// $pdf->Cell(10, 7, 'หรือตัวแทนประกันภัยจะไม่เป็นการผ่อนผันหรือทำให้ผู้กู้พ้นจากความรับผิดชอบดังกล่าว ', 0, 1);

$pdf->Cell(0, 8, '2. ผู้กู้ตกลงและยินยอมชำระต้นเงินกู้ ค่าธรรมเนียม และค่าใช้จ่ายต่างๆ ดังต่อไปนี้', 0, 1);

$pdf->MultiCell(190, 8, '2.1) หากผู้กู้ผิดนัดในการชำระเงินค่าเบี้ยประกันภัยงวดหนึ่งงวดใด จากวันครบกำหนดชำระค่าเบี้ยประกันภัยในงวดนั้น ผู้กู้ยินยอมเสียค่าปรับล่าช้าในอัตรา 200 บาท ต่องวด/ต่อครั้ง', '0', 'L', false);
// $pdf->Cell(10, 7, '2.1) หากผู้กู้ผิดนัดในการชำระเงินค่าเบี้ยประกันภัยงวดหนึ่งงวดใด จากวันครบกำหนดชำระค่าเบี้ยประกันภัยในงวดนั้น ผู้กู้ยินยอมเสียค่าปรับล่าช้าในอัตรา 200 บาท ต่องวด/ต่อครั้ง' , 0, 1);
// 
$pdf->Cell(10, 8, '2.2) หากผู้กู้ผิดนัดไม่ชำระหนี้เงินกู้ค่าเบี้ยประกันภัยเกิน 7 วัน นับจากวันที่ถึงกำหนดการชำระ หรือชำระเงินกู้ไม่ตรงตามเงื่อนไขการชำระเงินที่ให้', 0, 1);

$pdf->Cell(10, 8, 'ไว้กับผู้ให้กู้ไม่ว่าด้วยเหตุผลใดๆ ก็ตาม ผู้ให้กู้มีสิทธินำกรมธรรม์ประกันภัยในสัญญาให้สินเชื่อฉบับนี้ยกเลิก ทั้งนี้ผู้กู้ยินยอมให้ผู้ให้กู้ริบเงินทั้งหมดที่', 0, 1);
$pdf->Cell(10, 8, 'ผู้กู้ได้ชำระให้กับผู้ให้กู้ไปแล้วทั้งหมดหรือนำเงินคืนจากกรมธรรม์มาชำระหนี้เงินกู้ได้ อนึ่ง หากผู้กู้ผู้เอาประกันภัยได้ร้องขอต่อผู้ให้กู้เพื่อให้กรมธรรม์', 0, 1);
$pdf->Cell(10, 8, 'ประกันภัยยังคงมีผลคุ้มครองต่อไป และผู้ให้กู้เห็นสมควรที่จะผ่อนผันให้กับผู้กู้ ผู้กู้ยินยอมที่จะจ่ายค่าปรับล่าช้าเป็นจำนวนเงิน 500 บาทต่อครั้ง', 0, 1);
$pdf->Cell(10, 8, 'เพื่อเป็นประกันความเสียหายให้กับผู้ให้กู้ ทั้งนี้ อัตราค่าปรับกรณีล่าช้าผู้ให้กู้อาจพิจารณาเปลี่ยนแปลงได้ตามที่เห็นสมควรโดยมิต้องแจ้งให้ทราบล่วงหน้า', 0, 1);

// $pdf->MultiCell(190,10,'3. ในกรณีผู้กู้ผิดนัดหรือผิดข้อกำหนดและเงื่อนไขใดๆ ที่ผู้กู้มีต่อผู้ให้กู้และเมื่อผู้กู้เห็นสมควร ผู้ให้กู้อาจกำหนดให้ต้นเงินกู้และค่าธรรมเนียมและจำนวนเงินอื่นใดที่ผู้กู้ต้องชำระแก่ผู้ให้กู้ตามสัญญาฉบับนี้ถึงกำหนดชำระในทันทีโดยไม่ต้องมีทวงถามบอกกล่าวหรือดำเนินกระบวนการทางกฎหมายอื่นใดอีกต่อไป ทั้งนี้ผู้ให้กู้ไม่จำเป็นต้องแจ้งให้ผู้กู้ทราบล่วงหน้า','0','L',false);
$pdf->Cell(10, 8, '3. ในกรณีผู้กู้ผิดนัดหรือผิดข้อกำหนดและเงื่อนไขใดๆ ที่ผู้กู้มีต่อผู้ให้กู้และเมื่อผู้กู้เห็นสมควร ผู้ให้กู้อาจกำหนดให้ต้นเงินกู้และค่าธรรมเนียมและจำนวนเงิน', 0, 1);
$pdf->Cell(10, 8, 'อื่นใดที่ผู้กู้ต้องชำระแก่ผู้ให้กู้ตามสัญญาฉบับนี้ถึงกำหนดชำระในทันทีโดยไม่ต้องมีทวงถามบอกกล่าวหรือดำเนินกระบวนการทางกฎหมายอื่นใดอีกต่อไป ', 0, 1);
$pdf->Cell(10, 8, 'ทั้งนี้ผู้ให้กู้ไม่จำเป็นต้องแจ้งให้ผู้กู้ทราบล่วงหน้า', 0, 1);
$pdf->Ln(15);
$pdf->Cell(10, 8, 'ลงชื่อ'  . '   ________________________________    วันที่     ' . $pay1, 0, 'J');


$pdf->Image($signaturePath, 25, 255, $imageWidth, $imageHeight, 'PNG');
$pdf->Cell(10, 7, '                  ('  . $Name . ' ' . $Lname . ')', 0, 'J');
$pdf->Ln(10);
// $pdf->MultiCell(190,10,'4. หากผู้กู้ไม่มีการจดแจ้งเปลี่ยนแปลงที่อยู่ให้ถือเอาที่อยู่ซึ่งระบุไว้ด้านหน้ากรมธรรม์ประกันภัยเป็นสถานที่ติดต่อส่งคำบอกกล่าวต่อกันโดยชอบ หากการบอกกล่าวได้ส่งทางไปรษณีย์ลงทะเบียนแล้ว แต่มีสาเหตุทำให้ไม่สามารถส่งถึงมือผู้รับ/ผู้กู้ได้ไม่ว่าด้วยสาเหตุปราการใด ให้ถือว่าผู้ให้กู้ได้ส่งคำบอกกล่าวหรือแจ้งให้ผู้กู้ทราบโดยชอบแล้ว','0','L',false);
$pdf->Cell(10, 8, '4. หากผู้กู้ไม่มีการจดแจ้งเปลี่ยนแปลงที่อยู่ให้ถือเอาที่อยู่ซึ่งระบุไว้ด้านหน้ากรมธรรม์ประกันภัยเป็นสถานที่ติดต่อส่งคำบอกกล่าวต่อกันโดยชอบ ', 0, 1);
$pdf->Cell(10, 8, 'หากการบอกกล่าวได้ส่งทางไปรษณีย์ลงทะเบียนแล้ว แต่มีสาเหตุทำให้ไม่สามารถส่งถึงมือผู้รับ/ผู้กู้ได้ไม่ว่าด้วยสาเหตุปราการใด ให้ถือว่าผู้ให้กู้ได้ ', 0, 1);
$pdf->Cell(10, 8, 'ส่งคำบอกกล่าวหรือแจ้งให้ผู้กู้ทราบโดยชอบแล้ว', 0, 1);

$pdf->Cell(10, 8, '5. กรณีดังต่อไปนี้ให้ถือว่าหนี้ค่าเบี้ยประกันภัยทั้งหมดครบกำหนดชำระในทันที ', 0, 1);

$pdf->Cell(10, 8, '5.1) ผู้กู้ผิดนัดชำระหนี้เงินกู้ค่าเบี้ยประกันภัยงวดหนึ่งงวดใดที่เรียกเก็บในแต่ละงวด หรือเงินอื่นใดที่ผู้กู้มีหน้าที่ต้องชำระไม่ว่ามีการทวงถามหรือไม่ก็ตาม ', 0, 1);

$pdf->Cell(10, 8, '5.2) ผู้กู้ไม่ปฏิบัติตามข้อตกลง เงื่อนไข หรือข้อผูกพันใดๆ อันเป็นสาระสำคัญของสัญญานี้ ', 0, 1);
https: //www.twitch.tv/bboatx

$pdf->Cell(10, 8, '5.3)กรมธรรม์ถูกยกเลิกหรือสิ้นผลผูกพันไม่ว่าด้วยเหตุประการใดก็ตาม ', 0, 1);
$pdf->Cell(10, 8, '6. เพื่อเป็นหลักประกันต่อผู้ให้กู้', 0, 1);

$pdf->Cell(10, 8, '6.1) ผู้กู้จะมอบต้นฉบับกรมธรรม์ประกันภัยตามสัญญานี้แก่ผู้ให้กู้ไว้เป็นหลักประกันจนกว่าจะมีการชำระหนี้ครบถ้วนตามสัญญา', 0, 1);
// $pdf->MultiCell(190,10,'6.2)  ผู้กู้ได้โอนกรรมสิทธิ์หรือขอมอบอำนาจให้แก่ผู้ให้กู้โดยปราศจากข้อจำกัดใดๆที่จะลงนามในเอกสารที่จำเป็นเพื่อความสะดวกในการที่จะทำขึ้น ใหม่ทดแทนซี่งกรมธรรม์ยกเลิกหรือทำให้สิ้นผลผูกพันของกรมธรรม์เนื่องจากผู้กู้ผิดสัญญานี้รวมทั้งการรับชำระค่าเบี้ยประกันภัยทั้งหมดที่จ่ายคืนภายใต้เงื่อนไขกรมธรรม์ไม่ว่าจะเกิดจากเหตุใดก็ตาม ทั้งนี้ผู้ให้กู้ไม่ต้องรับผิดชอบความเสียหายที่อาจจะเกิดขึ้นภายหลังการยกเลิก หรือสิ้นผลผูกพันซึ่งกรมธรรม์ดังกล่าว','0','L',false);
$pdf->Cell(10, 8, '6.2) ผู้กู้ได้โอนกรรมสิทธิ์หรือขอมอบอำนาจให้แก่ผู้ให้กู้โดยปราศจากข้อจำกัดใดๆ ที่จะลงนามในเอกสารที่จำเป็นเพื่อความสะดวกในการที่จะทำขึ้นใหม่', 0, 1);
$pdf->Cell(10, 8, 'ทดแทนซี่งกรมธรรม์ยกเลิก หรือทำให้สิ้นผลผูกพันของกรมธรรม์เนื่องจากผู้กู้ผิดสัญญานี้ รวมทั้งการรับชำระค่าเบี้ยประกันภัยทั้งหมดที่จ่ายคืนภายใต้', 0, 1);
$pdf->Cell(10, 8, 'เงื่อนไขกรมธรรม์ไม่ว่าจะเกิดจากเหตุใดก็ตาม ทั้งนี้ผู้ให้กู้ไม่ต้องรับผิดชอบความเสียหายที่อาจจะเกิดขึ้นภายหลังการยกเลิก หรือสิ้นผลผูกพันซึ่งกรมธรรม์', 0, 1);
$pdf->Cell(10, 8, 'ดังกล่าว', 0, 1);
// $pdf->MultiCell(190,10,'6.3) ผู้กู้ได้โอนสิทธิเรียกร้องในการรับเงินค่าสินไหมทดแทนค่าเสียหายหรือสิทธิประโยชน์อื่นใดที่มีในกรมธรรม์แก่ผู้ให้กู้ เพื่อเป็นหลักประกันในจำนวนเงินทั้งหมดที่ต้องชำระตามสัญญานี้ ผู้ให้กู้สามารถ นำเงินที่ได้รับตามสิทธิข้างต้นหักชำระหนี้ของผู้กู้ตามสัญญานี้ได้ ทั้งนี้หากมีเงินคงเหลือจากค่าสินไหมทดแทนดังกล่าว ผู้ให้กู้ต้องคืนให้แก่ผู้กู้','0','L',false);
$pdf->Cell(10, 8, '6.3) ผู้กู้ได้โอนสิทธิเรียกร้องในการรับเงินค่าสินไหมทดแทนค่าเสียหายหรือสิทธิประโยชน์อื่นใดที่มีในกรมธรรม์แก่ผู้ให้กู้ เพื่อเป็นหลักประกันในจำนวนเงินทั้งหมด', 0, 1);

$pdf->Cell(0, 8, 'ที่ต้องชำระตามสัญญานี้ ผู้ให้กู้สามารถนำเงินที่ได้รับตามสิทธิข้างต้นหักชำระหนี้ของผู้กู้ตามสัญญานี้ได้ ทั้งนี้หากมีเงินคงเหลือจากค่าสินไหมทดแทนดังกล่าว ', 0, 1);
$pdf->Cell(0, 8, 'ผู้ให้กู้ต้องคืนให้แก่ผู้กู้', 0, 1);
// $pdf->MultiCell(190,10,'7. ผู้กู้ตกลงว่าการที่ผู้ให้กู้ยอมผ่อนผันแก่ผู้กู้ในการปฏิบัติตามข้อกำหนดในสัญญาหรือผ่อนเวลาให้ผู้กู้ไม่เป็นการทำให้เสื่อมสิทธิหรืออำนาจอย่างใดๆ ของผู้ให้กู้ตามสัญญานี้','0','L',false);
$pdf->Cell(10, 8, '7. ผู้กู้ตกลงว่าการที่ผู้ให้กู้ยอมผ่อนผันแก่ผู้กู้ในการปฏิบัติตามข้อกำหนดในสัญญาหรือผ่อนเวลาให้ผู้กู้ไม่เป็นการทำให้เสื่อมสิทธิหรืออำนาจอย่างใดๆ', 0, 1);
$pdf->Cell(10, 8, 'ของผู้ให้กู้ตามสัญญานี้', 0, 1);
// $pdf->MultiCell(190,10,'8. ผู้ให้กู้สงวนสิทธิในการปรับปรุง เปลี่ยนแปลง เพิ่มเติม หรือแก้ไขข้อกำหนดและเงื่อนไขใดๆ ในเรื่องอัตราดอกเบี้ย ค่าธรรมเนียม ค่าปรับหรือค่าใช้จ่ายต่าง ๆที่ผู้ให้กู้มีสิทธิเรียกเก็บตามสัญญานี้รวมทั้งระยะเวลาและวิธีการจ่ายต้นเงินกู้และระยะเวลาและวิธีการชำระคืนเงินกู้ ดอกเบี้ย ค่าธรรมเนียม และค่าใช้จ่ายใดๆ ตามที่ผู้ให้กู้จะเห็นสมควร ทั้งนี้โดยผู้ให้กู้ไม่จำเป็นต้องแจ้งให้ทราบล่วงหน้า','0','L',false);
$pdf->Cell(10, 8, '8. ผู้ให้กู้สงวนสิทธิในการปรับปรุง เปลี่ยนแปลง เพิ่มเติม หรือแก้ไขข้อกำหนดและเงื่อนไขใดๆ ในเรื่องอัตราดอกเบี้ย ค่าธรรมเนียม ค่าปรับหรือค่าใช้จ่ายต่างๆ', 0, 1);
$pdf->Cell(10, 8, 'ที่ผู้ให้กู้มีสิทธิเรียกเก็บตามสัญญานี้รวมทั้งระยะเวลาและวิธีการจ่ายต้นเงินกู้และระยะเวลาและวิธีการชำระคืนเงินกู้ ดอกเบี้ย ค่าธรรมเนียม และค่าใช้จ่ายใดๆ', 0, 1);
$pdf->Cell(10, 8, 'ตามที่ผู้ให้กู้จะเห็นสมควร ทั้งนี้โดยผู้ให้กู้ไม่จำเป็นต้องแจ้งให้ทราบล่วงหน้า', 0, 1);
// $pdf->MultiCell(190,10,'9. ผู้กู้ตกลงและรับทราบว่าการชำระหนี้ค่าเบี้ยประกันภัย ค่าธรรมเนียม ค่าใช้จ่ายใดๆ  ที่ผู้กู้มีหน้าที่ต้องชำระให้แก่ผู้ให้กู้ตามสัญญาฉบับนี้สามารถทำตามช่องทางการชำระเงินด้านล่างนี้เท่านั้น ชำระผ่าน ณ ที่ทำการธนาคาร ชื่อบัญชี ดีน่าโบรคเกอร์ โดย นางสาว กุลิสรา วงษ์เทศ ดังต่อไปนี้','0','L',false);
$pdf->Cell(10, 8, '9. ผู้กู้ตกลงและรับทราบว่าการชำระหนี้ค่าเบี้ยประกันภัย ค่าธรรมเนียม ค่าใช้จ่ายใดๆ  ที่ผู้กู้มีหน้าที่ต้องชำระให้แก่ผู้ให้กู้ตามสัญญาฉบับนี้สามารถทำตามช่องทาง', 0, 1);

$pdf->Cell(10, 8, 'การชำระเงินด้านล่างนี้เท่านั้น ชำระผ่าน ณ ที่ทำการธนาคาร ชื่อบัญชี ดีน่าโบรคเกอร์ โดย นางสาว กุลิสรา วงษ์เทศ ดังต่อไปนี้', 0, 1);

$pdf->Cell(10, 8, '9.1) ธนาคาร กสิกรไทย สาขาเดอะมอลล์ บางแค เลขที่ 028 863 090 9    9.2) ธนาคาร กรุงไทย สาขาเดอะมอลล์ บางแค เลขที่ 028 863 090 9', 0, 1);

$pdf->Cell(10, 8, '9.3) ธนาคาร ไทยพาณิชย์ สาขาบิ๊กซี เพชรเกษม2 เลขที่ 408 128 020 3    9.4) ธนาคาร กรุงเทพ สาขาบิ๊กซี เพชรเกษม2 เลขที่ 078 400 107 5', 0, 1);

$pdf->Cell(10, 8, '10. สัญญาฉบับนี้แต่ละข้อเป็นอิสระต่างหากจากกัน ในกรณีส่วนหนึ่งส่วนใดของสัญญาฉบับนี้ไม่สามารถใช้บังคับได้ ก็ให้สัญญาส่วนที่เหลือมีผลบังคับ', 0, 1);

$pdf->Cell(10, 8, 'ต่อกันได้ เพื่อเป็นหลักฐานแห่งการนี้จึงได้ลงลายมือชื่อไว้เนสำคัญ   ณ วัน เดือน ปี ที่ระบุด้านหน้านี้แล้ว', 0, 1);
$pdf->Ln(10);
$pdf->Cell(10, 8, ' กรมธรรม์จะมีผลคุ้มครองต่อเมื่อผู้ให้กู้ได้รับการชำระเบี้ยประกันภัยงวดแรกครบถ้วนจากผู้กู้แล้ว', 0, 1);
$pdf->Ln(15);
$pdf->Cell(10, 8, 'ลงชื่อ'  . '   ________________________________    วันที่     ' . $pay1, 0, 'J');


$pdf->Image($signaturePath, 25, 252, $imageWidth, $imageHeight, 'PNG');
$pdf->Cell(10, 7, '                  ('  . $Name . ' ' . $Lname . ')', 0, 'J');

$pdf->AddPage();
// Set font and font size
$pdf->SetXY(0, 20);
$pdf->SetFont(THSarabunNew, '', 14);
$pdf->SetXY(10, 30);
$pdf->Cell(0, 7, 'เรื่อง  ขอยกเลิกถอนกรมธรรม์ประกันภัย', 0, 1);
$pdf->Ln(7);
$pdf->Cell(0, 7, 'เรียน  ' . $callback, 0, 1);
$pdf->Ln(7);
$pdf->Cell(0, 7, 'ข้าพเจ้า  ' . $Name . ' ' . $Lname . ' มีความประสงค์', 0, 1);

$pdf->Cell(0, 7, ' ขอยกเลิก และ / หรือ ถอนกรมธรรม์ประกันภัยรถยนต์ทะเบียน : ' . $Num, 0, 1);

$pdf->Cell(0, 7, ' ทั้งกรมธรรม์ประกันรถยนต์ ประเภท 3 และ พรบ.รถยนต์', 0, 1);
$pdf->Ln(7);
$pdf->Ln(7);
$pdf->Cell(0, 7, 'ทั้งนี้  ข้าพเจ้าขอให้บริษัทประกันภัยจ่ายคืนจำนวนเงินค่าเบี้ยประกันภัยและ/หรือส่วนที่เหลือจากการยกเลิกหรือถอนกรมธรรม์ประกันภัย', 0, 1);

$pdf->Cell(0, 7, 'ให้แก่ นางสาว กุลิสรา  วงษ์เทศ โดยคืนเงินดังกล่าวข้างต้นให้ถือเสมือนหนึ่งว่าข้าพเจ้าเป็นผู้ได้รับเงินคืนเองทุกประการ  และข้าพเจ้าทราบดีว่าภายหลัง', 0, 1);

$pdf->Cell(0, 7, 'จากนี้ความคุ้มครองตามกรมธรรม์ประกันภัยดังกล่าวของข้าพเจ้าได้สิ้นสุดแล้ว หากมีความเสียหายใด ๆ เกิดขึ้น  ข้าพเจ้ารับทราบและตกลงยินยอม', 0, 1);

$pdf->Cell(10, 7, 'รับผิดชอบด้วยตนเองทุกประการ  นอกเหนือจากนี้ข้าพเจ้าขอตกลงด้วยว่าข้าพเจ้าจะไม่เรียกร้องหรือฟ้องร้องดำเนินคดีใดๆ กับบริษัทประกันภัย', 0, 1);

$pdf->Cell(10, 7, 'และ/หรือนายหน้าประกันภัย รวมทั้งผู้ที่เกี่ยวข้องอื่นใดทั้งสิ้น', 0, 1);
$pdf->Ln(7);
$pdf->Ln(7);
$pdf->Cell(10, 7, '               จึงเรียนมาเพื่อโปรดดำเนินการยกเลิกกรมธรรม์และ/หรือถอนประกันภัยตามความประสงค์ของข้าพเจ้าดังกล่าว', 0, 1);
$pdf->Ln(7);
$pdf->Ln(7);
$pdf->Ln(7);
$pdf->Ln(7);
$pdf->Cell(10, 7, '                                                       ขอแสดงความนับถือ', 0, 1);
$pdf->Ln(7);
$pdf->Ln(7);
$pdf->Cell(10, 7, '                                 ลงชื่อ'  . '   ________________________________  ', 0, 'J');
$pdf->Image($signaturePath, 60, 150 + (6 * 7), $imageWidth, $imageHeight, 'PNG');
$pdf->Cell(10, 7, '                                                       ' . $Name . ' ' . $Lname, 0, 1);
$pdf->AddPage();
// Set font and font size
$pdf->SetXY(0, 20);
$pdf->SetFont(THSarabunNewBold, '', 16);
$pdf->Cell(0, 0, 'สัญญาขอสินเชื่อค่าเบี้ยประกันภัย', 0, 1, 'C');
$pdf->Ln(10);

$pdf->SetFont(THSarabunNew, '', 13);
$pdf->SetXY(10, 30);
$pdf->Cell(0, 8, 'ข้าพเจ้า ' . $Name . ' ' . $Lname . '    (ผู้กู้)  เป็นผู้เอาประกันภัยรถยนต์ทะเบียน  :' . $Num, 0, 1);

$pdf->Cell(0, 8, 'ซึ่งขอทำประกันภัยไว้กับ ' . $callback . '   ผ่านตัวแทน/นายหน้า นางสาว กุลิสรา  วงษ์เทศ', 0, 1);

$pdf->MultiCell(190, 8, 'ขอเข้าทำสัญญากับ นางสาว กุลิสรา  วงษ์เทศ ("ผู้ให้กู้")  ในการขอรับสินเชื่อค่าเบี้ยประกันภัยที่ระบุไว้บนกรมธรรม์ประกันภัยรวมถึงเอกสารแนบท้ายสัญญาประกันภัยด้วย  โดยข้าพเจ้าขอให้คำยืนยัน ต่อผู้ให้กู้ว่าจะปฏิบัติและยินยอมผูกพันตามข้อกำหนดและเงื่อนไขของสัญญาขอสินเชื่อค่าเบี้ยประกันภัยโดยมีรายละเอียดดังต่อไปนี้', '0', 'L', false);

$pdf->Cell(0, 8, '1. ผู้กู้สัญญาว่า ', 0, 1);

// $pdf->MultiCell(190,10,'1.1) ผู้กู้มีหน้าที่ตรวจสอบความถูกต้องของกรมธรรม์ประกันภัยและเอกสารแนบท้ายสัญญาประกันต่างๆหากมีความผิดพลาดประการใดเกี่ยวกับกรมธรรม์ประกันภัยหรือเอกสารแนบท้ายสัญญาประกันภัยจนอาจเป็นผลทำให้ผู้รับประกันภัยปฏิเสธการเรียกร้องค่าสินไหมทดแทนไม่ว่าด้วยสาเหตุประกาศใดให้ถือว่าเป็นความรับผิดชอบของผู้กู้โดยยินยอมรับผิดชอบความเสียหายนั่นเองเป็นการเฉพาะตัว','0','L',false);
$pdf->Cell(10, 8, '1.1) ผู้กู้มีหน้าที่ตรวจสอบความถูกต้องของกรมธรรม์ประกันภัยและเอกสารแนบท้ายสัญญาประกันต่าง ๆ หากมีความผิดพลาดประการใดเกี่ยวกับ ', 0, 1);
$pdf->Cell(10, 8, 'กรมธรรม์ประกันภัยหรือเอกสารแนบท้ายสัญญาประกันภัยจนอาจเป็นผลทำให้ผู้รับประกันภัยปฏิเสธการเรียกร้องค่าสินไหมทดแทนไม่ว่าด้วยสาเหตุ', 0, 1);
$pdf->Cell(10, 8, ' ประกาศใด ให้ถือว่าเป็นความรับผิดชอบของผู้กู้  โดยยินยอมรับผิดชอบความเสียหายนั่นเอง เป็นการเฉพาะตัว', 0, 1);
// $pdf->MultiCell(190,10,'1.2) หากผู้กู้มีการแจ้งเคลมสินไหมเกิดขึ้นผู้กู้ตกลงว่าผู้กู้มีหน้าที่ต้องชำระค่าเบี้ยประกันภัยที่ยังคงค้างอยู่รวมถึงค่าเบี้ยประกันภัยในงวดถัดไปให้กับผู้ให้กู้ทันทีทั้งนี้หากผู้กู้เพิกเฉยไม่ปฏิบัติตาม ','0','L',false);
$pdf->Cell(10, 8, '1.2) หากผู้กู้มีการแจ้งเคลมสินไหมเกิดขึ้น  ผู้กู้ตกลงว่าผู้กู้มีหน้าที่ต้องชำระค่าเบี้ยประกันภัยที่ยังคงค้างอยู่รวมถึงค่าเบี้ยประกันภัยในงวดถัดไปให้', 0, 1);
$pdf->Cell(10, 8, 'กับผู้ให้กู้ทันที  ทั้งนี้หากผู้กู้เพิกเฉยไม่ปฏิบัติตาม', 0, 1);

$pdf->Cell(10, 8, '1.3) หากมีการแจ้งเปลี่ยนแปลงใดๆ ในกรมธรรม์ประกันภัย ผู้กู้มีหน้าที่ต้องแจ้งการเปลี่ยนแปลงดังกล่าวแก่ผู้ให้กู้ทันที', 0, 1);

$pdf->Cell(10, 8, '1.4) ผู้กู้ยอมเข้าผูกพันตนว่าจะไม่ยกเลิกกรมธรรม์ประกันภัยตามสัญญานี้  หรือจะไม่ทำการมอบให้  โอน  จำนำ  ค้ำประกันโดยมิได้รับความยินยอม', 0, 1);
$pdf->Cell(10, 8, 'เป็นลายลักษณ์อักษรจากผู้ให้กู้', 0, 1);

// $pdf->MultiCell(190,10,'1.5) หากทรัพย์สินที่เอาประกันภัยเกิดความเสียหายสิ้นเชิงหรือเสียหายเสมือนสิ้นเชิง ซึ่งส่งผลให้กรมธรรม์ประกันภัยยกเลิกหรือสิ้นสุด ผู้กู้ตกลงว่าผู้กู้จะชำระค่าเบี้ยประกันภัยทั้งหมดให้กับผู้ให้กู้ทันที ไม่ว่าค่าเบี้ยประกันภัยในแต่ละงวดจะถึงกำหนดชำระแล้วหรือไม่','0','L',false);
$pdf->Cell(10, 8, '1.5) หากทรัพย์สินที่เอาประกันภัยเกิดความเสียหายสิ้นเชิงหรือเสียหายเสมือนสิ้นเชิง ซึ่งส่งผลให้กรมธรรม์ประกันภัยยกเลิกหรือสิ้นสุด', 0, 1);

$pdf->Cell(10, 8, 'ผู้กู้ตกลงว่าผู้กู้จะชำระค่าเบี้ยประกันภัยทั้งหมดให้กับผู้ให้กู้ทันที ไม่ว่าค่าเบี้ยประกันภัยในแต่ละงวดจะถึงกำหนดชำระแล้วหรือไม่', 0, 1);

$pdf->MultiCell(190, 8, '1.6) ผู้กู้จะต้องรับผิดชอบในจำนวนเงินกู้ทั้งหมดที่ได้รับจากผู้ให้กู้ไปแล้วโดยตัวของผู้กู้เองหรือโดยนายหน้าประกันภัย หรือตัวแทนประกันภัย ผู้กู้ทราบดีว่าการกระทำใดๆ ของผู้ให้กู้ นายหน้าประกันภัย หรือตัวแทนประกันภัยจะไม่เป็นการผ่อนผันหรือทำให้ผู้กู้พ้นจากความรับผิดชอบดังกล่าว', '0', 'L', false);
// $pdf->Cell(10, 7, '1.6) ผู้กู้จะต้องรับผิดชอบในจำนวนเงินกู้ทั้งหมดที่ได้รับจากผู้ให้กู้ไปแล้วโดยตัวของผู้กู้เองหรือโดยนายหน้าประกันภัย หรือตัวแทนประกันภัย ผู้กู้ทราบดีว่าการกระทำใดๆ ของผู้ให้กู้ นายหน้าประกันภัย' , 0, 1);

// $pdf->Cell(10, 7, 'หรือตัวแทนประกันภัยจะไม่เป็นการผ่อนผันหรือทำให้ผู้กู้พ้นจากความรับผิดชอบดังกล่าว ', 0, 1);

$pdf->Cell(0, 8, '2. ผู้กู้ตกลงและยินยอมชำระต้นเงินกู้ ค่าธรรมเนียม และค่าใช้จ่ายต่างๆ ดังต่อไปนี้', 0, 1);

$pdf->MultiCell(190, 8, '2.1) หากผู้กู้ผิดนัดในการชำระเงินค่าเบี้ยประกันภัยงวดหนึ่งงวดใด จากวันครบกำหนดชำระค่าเบี้ยประกันภัยในงวดนั้น ผู้กู้ยินยอมเสียค่าปรับล่าช้าในอัตรา 200 บาท ต่องวด/ต่อครั้ง', '0', 'L', false);
// $pdf->Cell(10, 7, '2.1) หากผู้กู้ผิดนัดในการชำระเงินค่าเบี้ยประกันภัยงวดหนึ่งงวดใด จากวันครบกำหนดชำระค่าเบี้ยประกันภัยในงวดนั้น ผู้กู้ยินยอมเสียค่าปรับล่าช้าในอัตรา 200 บาท ต่องวด/ต่อครั้ง' , 0, 1);
// 
$pdf->Cell(10, 8, '2.2) หากผู้กู้ผิดนัดไม่ชำระหนี้เงินกู้ค่าเบี้ยประกันภัยเกิน 7 วัน นับจากวันที่ถึงกำหนดการชำระ หรือชำระเงินกู้ไม่ตรงตามเงื่อนไขการชำระเงินที่ให้', 0, 1);

$pdf->Cell(10, 8, 'ไว้กับผู้ให้กู้ไม่ว่าด้วยเหตุผลใดๆ ก็ตาม ผู้ให้กู้มีสิทธินำกรมธรรม์ประกันภัยในสัญญาให้สินเชื่อฉบับนี้ยกเลิก ทั้งนี้ผู้กู้ยินยอมให้ผู้ให้กู้ริบเงินทั้งหมดที่', 0, 1);
$pdf->Cell(10, 8, 'ผู้กู้ได้ชำระให้กับผู้ให้กู้ไปแล้วทั้งหมดหรือนำเงินคืนจากกรมธรรม์มาชำระหนี้เงินกู้ได้ อนึ่ง หากผู้กู้ผู้เอาประกันภัยได้ร้องขอต่อผู้ให้กู้เพื่อให้กรมธรรม์', 0, 1);
$pdf->Cell(10, 8, 'ประกันภัยยังคงมีผลคุ้มครองต่อไป และผู้ให้กู้เห็นสมควรที่จะผ่อนผันให้กับผู้กู้ ผู้กู้ยินยอมที่จะจ่ายค่าปรับล่าช้าเป็นจำนวนเงิน 500 บาทต่อครั้ง', 0, 1);
$pdf->Cell(10, 8, 'เพื่อเป็นประกันความเสียหายให้กับผู้ให้กู้ ทั้งนี้ อัตราค่าปรับกรณีล่าช้าผู้ให้กู้อาจพิจารณาเปลี่ยนแปลงได้ตามที่เห็นสมควรโดยมิต้องแจ้งให้ทราบล่วงหน้า', 0, 1);

// $pdf->MultiCell(190,10,'3. ในกรณีผู้กู้ผิดนัดหรือผิดข้อกำหนดและเงื่อนไขใดๆ ที่ผู้กู้มีต่อผู้ให้กู้และเมื่อผู้กู้เห็นสมควร ผู้ให้กู้อาจกำหนดให้ต้นเงินกู้และค่าธรรมเนียมและจำนวนเงินอื่นใดที่ผู้กู้ต้องชำระแก่ผู้ให้กู้ตามสัญญาฉบับนี้ถึงกำหนดชำระในทันทีโดยไม่ต้องมีทวงถามบอกกล่าวหรือดำเนินกระบวนการทางกฎหมายอื่นใดอีกต่อไป ทั้งนี้ผู้ให้กู้ไม่จำเป็นต้องแจ้งให้ผู้กู้ทราบล่วงหน้า','0','L',false);
$pdf->Cell(10, 8, '3. ในกรณีผู้กู้ผิดนัดหรือผิดข้อกำหนดและเงื่อนไขใดๆ ที่ผู้กู้มีต่อผู้ให้กู้และเมื่อผู้กู้เห็นสมควร ผู้ให้กู้อาจกำหนดให้ต้นเงินกู้และค่าธรรมเนียมและจำนวนเงิน', 0, 1);
$pdf->Cell(10, 8, 'อื่นใดที่ผู้กู้ต้องชำระแก่ผู้ให้กู้ตามสัญญาฉบับนี้ถึงกำหนดชำระในทันทีโดยไม่ต้องมีทวงถามบอกกล่าวหรือดำเนินกระบวนการทางกฎหมายอื่นใดอีกต่อไป ', 0, 1);
$pdf->Cell(10, 8, 'ทั้งนี้ผู้ให้กู้ไม่จำเป็นต้องแจ้งให้ผู้กู้ทราบล่วงหน้า', 0, 1);
$pdf->Ln(15);
$pdf->Cell(10, 8, 'ลงชื่อ'  . '   ________________________________    วันที่     ' . $pay1, 0, 'J');


$pdf->Image($signaturePath, 25, 255, $imageWidth, $imageHeight, 'PNG');
$pdf->Cell(10, 7, '                  ('  . $Name . ' ' . $Lname . ')', 0, 'J');
$pdf->Ln(10);
// $pdf->MultiCell(190,10,'4. หากผู้กู้ไม่มีการจดแจ้งเปลี่ยนแปลงที่อยู่ให้ถือเอาที่อยู่ซึ่งระบุไว้ด้านหน้ากรมธรรม์ประกันภัยเป็นสถานที่ติดต่อส่งคำบอกกล่าวต่อกันโดยชอบ หากการบอกกล่าวได้ส่งทางไปรษณีย์ลงทะเบียนแล้ว แต่มีสาเหตุทำให้ไม่สามารถส่งถึงมือผู้รับ/ผู้กู้ได้ไม่ว่าด้วยสาเหตุปราการใด ให้ถือว่าผู้ให้กู้ได้ส่งคำบอกกล่าวหรือแจ้งให้ผู้กู้ทราบโดยชอบแล้ว','0','L',false);
$pdf->Cell(10, 8, '4. หากผู้กู้ไม่มีการจดแจ้งเปลี่ยนแปลงที่อยู่ให้ถือเอาที่อยู่ซึ่งระบุไว้ด้านหน้ากรมธรรม์ประกันภัยเป็นสถานที่ติดต่อส่งคำบอกกล่าวต่อกันโดยชอบ ', 0, 1);
$pdf->Cell(10, 8, 'หากการบอกกล่าวได้ส่งทางไปรษณีย์ลงทะเบียนแล้ว แต่มีสาเหตุทำให้ไม่สามารถส่งถึงมือผู้รับ/ผู้กู้ได้ไม่ว่าด้วยสาเหตุปราการใด ให้ถือว่าผู้ให้กู้ได้ ', 0, 1);
$pdf->Cell(10, 8, 'ส่งคำบอกกล่าวหรือแจ้งให้ผู้กู้ทราบโดยชอบแล้ว', 0, 1);

$pdf->Cell(10, 8, '5. กรณีดังต่อไปนี้ให้ถือว่าหนี้ค่าเบี้ยประกันภัยทั้งหมดครบกำหนดชำระในทันที ', 0, 1);

$pdf->Cell(10, 8, '5.1) ผู้กู้ผิดนัดชำระหนี้เงินกู้ค่าเบี้ยประกันภัยงวดหนึ่งงวดใดที่เรียกเก็บในแต่ละงวด หรือเงินอื่นใดที่ผู้กู้มีหน้าที่ต้องชำระไม่ว่ามีการทวงถามหรือไม่ก็ตาม ', 0, 1);

$pdf->Cell(10, 8, '5.2) ผู้กู้ไม่ปฏิบัติตามข้อตกลง เงื่อนไข หรือข้อผูกพันใดๆ อันเป็นสาระสำคัญของสัญญานี้ ', 0, 1);

$pdf->Cell(10, 8, '5.3)กรมธรรม์ถูกยกเลิกหรือสิ้นผลผูกพันไม่ว่าด้วยเหตุประการใดก็ตาม ', 0, 1);
$pdf->Cell(10, 8, '6. เพื่อเป็นหลักประกันต่อผู้ให้กู้', 0, 1);

$pdf->Cell(10, 8, '6.1) ผู้กู้จะมอบต้นฉบับกรมธรรม์ประกันภัยตามสัญญานี้แก่ผู้ให้กู้ไว้เป็นหลักประกันจนกว่าจะมีการชำระหนี้ครบถ้วนตามสัญญา', 0, 1);
// $pdf->MultiCell(190,10,'6.2)  ผู้กู้ได้โอนกรรมสิทธิ์หรือขอมอบอำนาจให้แก่ผู้ให้กู้โดยปราศจากข้อจำกัดใดๆที่จะลงนามในเอกสารที่จำเป็นเพื่อความสะดวกในการที่จะทำขึ้น ใหม่ทดแทนซี่งกรมธรรม์ยกเลิกหรือทำให้สิ้นผลผูกพันของกรมธรรม์เนื่องจากผู้กู้ผิดสัญญานี้รวมทั้งการรับชำระค่าเบี้ยประกันภัยทั้งหมดที่จ่ายคืนภายใต้เงื่อนไขกรมธรรม์ไม่ว่าจะเกิดจากเหตุใดก็ตาม ทั้งนี้ผู้ให้กู้ไม่ต้องรับผิดชอบความเสียหายที่อาจจะเกิดขึ้นภายหลังการยกเลิก หรือสิ้นผลผูกพันซึ่งกรมธรรม์ดังกล่าว','0','L',false);
$pdf->Cell(10, 8, '6.2) ผู้กู้ได้โอนกรรมสิทธิ์หรือขอมอบอำนาจให้แก่ผู้ให้กู้โดยปราศจากข้อจำกัดใดๆ ที่จะลงนามในเอกสารที่จำเป็นเพื่อความสะดวกในการที่จะทำขึ้นใหม่', 0, 1);
$pdf->Cell(10, 8, 'ทดแทนซี่งกรมธรรม์ยกเลิก หรือทำให้สิ้นผลผูกพันของกรมธรรม์เนื่องจากผู้กู้ผิดสัญญานี้ รวมทั้งการรับชำระค่าเบี้ยประกันภัยทั้งหมดที่จ่ายคืนภายใต้', 0, 1);
$pdf->Cell(10, 8, 'เงื่อนไขกรมธรรม์ไม่ว่าจะเกิดจากเหตุใดก็ตาม ทั้งนี้ผู้ให้กู้ไม่ต้องรับผิดชอบความเสียหายที่อาจจะเกิดขึ้นภายหลังการยกเลิก หรือสิ้นผลผูกพันซึ่งกรมธรรม์', 0, 1);
$pdf->Cell(10, 8, 'ดังกล่าว', 0, 1);
// $pdf->MultiCell(190,10,'6.3) ผู้กู้ได้โอนสิทธิเรียกร้องในการรับเงินค่าสินไหมทดแทนค่าเสียหายหรือสิทธิประโยชน์อื่นใดที่มีในกรมธรรม์แก่ผู้ให้กู้ เพื่อเป็นหลักประกันในจำนวนเงินทั้งหมดที่ต้องชำระตามสัญญานี้ ผู้ให้กู้สามารถ นำเงินที่ได้รับตามสิทธิข้างต้นหักชำระหนี้ของผู้กู้ตามสัญญานี้ได้ ทั้งนี้หากมีเงินคงเหลือจากค่าสินไหมทดแทนดังกล่าว ผู้ให้กู้ต้องคืนให้แก่ผู้กู้','0','L',false);
$pdf->Cell(10, 8, '6.3) ผู้กู้ได้โอนสิทธิเรียกร้องในการรับเงินค่าสินไหมทดแทนค่าเสียหายหรือสิทธิประโยชน์อื่นใดที่มีในกรมธรรม์แก่ผู้ให้กู้ เพื่อเป็นหลักประกันในจำนวนเงินทั้งหมด', 0, 1);

$pdf->Cell(0, 8, 'ที่ต้องชำระตามสัญญานี้ ผู้ให้กู้สามารถนำเงินที่ได้รับตามสิทธิข้างต้นหักชำระหนี้ของผู้กู้ตามสัญญานี้ได้ ทั้งนี้หากมีเงินคงเหลือจากค่าสินไหมทดแทนดังกล่าว ', 0, 1);
$pdf->Cell(0, 8, 'ผู้ให้กู้ต้องคืนให้แก่ผู้กู้', 0, 1);
// $pdf->MultiCell(190,10,'7. ผู้กู้ตกลงว่าการที่ผู้ให้กู้ยอมผ่อนผันแก่ผู้กู้ในการปฏิบัติตามข้อกำหนดในสัญญาหรือผ่อนเวลาให้ผู้กู้ไม่เป็นการทำให้เสื่อมสิทธิหรืออำนาจอย่างใดๆ ของผู้ให้กู้ตามสัญญานี้','0','L',false);
$pdf->Cell(10, 8, '7. ผู้กู้ตกลงว่าการที่ผู้ให้กู้ยอมผ่อนผันแก่ผู้กู้ในการปฏิบัติตามข้อกำหนดในสัญญาหรือผ่อนเวลาให้ผู้กู้ไม่เป็นการทำให้เสื่อมสิทธิหรืออำนาจอย่างใดๆ', 0, 1);
$pdf->Cell(10, 8, 'ของผู้ให้กู้ตามสัญญานี้', 0, 1);
// $pdf->MultiCell(190,10,'8. ผู้ให้กู้สงวนสิทธิในการปรับปรุง เปลี่ยนแปลง เพิ่มเติม หรือแก้ไขข้อกำหนดและเงื่อนไขใดๆ ในเรื่องอัตราดอกเบี้ย ค่าธรรมเนียม ค่าปรับหรือค่าใช้จ่ายต่าง ๆที่ผู้ให้กู้มีสิทธิเรียกเก็บตามสัญญานี้รวมทั้งระยะเวลาและวิธีการจ่ายต้นเงินกู้และระยะเวลาและวิธีการชำระคืนเงินกู้ ดอกเบี้ย ค่าธรรมเนียม และค่าใช้จ่ายใดๆ ตามที่ผู้ให้กู้จะเห็นสมควร ทั้งนี้โดยผู้ให้กู้ไม่จำเป็นต้องแจ้งให้ทราบล่วงหน้า','0','L',false);
$pdf->Cell(10, 8, '8. ผู้ให้กู้สงวนสิทธิในการปรับปรุง เปลี่ยนแปลง เพิ่มเติม หรือแก้ไขข้อกำหนดและเงื่อนไขใดๆ ในเรื่องอัตราดอกเบี้ย ค่าธรรมเนียม ค่าปรับหรือค่าใช้จ่ายต่างๆ', 0, 1);
$pdf->Cell(10, 8, 'ที่ผู้ให้กู้มีสิทธิเรียกเก็บตามสัญญานี้รวมทั้งระยะเวลาและวิธีการจ่ายต้นเงินกู้และระยะเวลาและวิธีการชำระคืนเงินกู้ ดอกเบี้ย ค่าธรรมเนียม และค่าใช้จ่ายใดๆ', 0, 1);
$pdf->Cell(10, 8, 'ตามที่ผู้ให้กู้จะเห็นสมควร ทั้งนี้โดยผู้ให้กู้ไม่จำเป็นต้องแจ้งให้ทราบล่วงหน้า', 0, 1);
// $pdf->MultiCell(190,10,'9. ผู้กู้ตกลงและรับทราบว่าการชำระหนี้ค่าเบี้ยประกันภัย ค่าธรรมเนียม ค่าใช้จ่ายใดๆ  ที่ผู้กู้มีหน้าที่ต้องชำระให้แก่ผู้ให้กู้ตามสัญญาฉบับนี้สามารถทำตามช่องทางการชำระเงินด้านล่างนี้เท่านั้น ชำระผ่าน ณ ที่ทำการธนาคาร ชื่อบัญชี ดีน่าโบรคเกอร์ โดย นางสาว กุลิสรา วงษ์เทศ ดังต่อไปนี้','0','L',false);
$pdf->Cell(10, 8, '9. ผู้กู้ตกลงและรับทราบว่าการชำระหนี้ค่าเบี้ยประกันภัย ค่าธรรมเนียม ค่าใช้จ่ายใดๆ  ที่ผู้กู้มีหน้าที่ต้องชำระให้แก่ผู้ให้กู้ตามสัญญาฉบับนี้สามารถทำตามช่องทาง', 0, 1);

$pdf->Cell(10, 8, 'การชำระเงินด้านล่างนี้เท่านั้น ชำระผ่าน ณ ที่ทำการธนาคาร ชื่อบัญชี ดีน่าโบรคเกอร์ โดย นางสาว กุลิสรา วงษ์เทศ ดังต่อไปนี้', 0, 1);

$pdf->Cell(10, 8, '9.1) ธนาคาร กสิกรไทย สาขาเดอะมอลล์ บางแค เลขที่ 028 863 090 9    9.2) ธนาคาร กรุงไทย สาขาเดอะมอลล์ บางแค เลขที่ 028 863 090 9', 0, 1);

$pdf->Cell(10, 8, '9.3) ธนาคาร ไทยพาณิชย์ สาขาบิ๊กซี เพชรเกษม2 เลขที่ 408 128 020 3    9.4) ธนาคาร กรุงเทพ สาขาบิ๊กซี เพชรเกษม2 เลขที่ 078 400 107 5', 0, 1);

$pdf->Cell(10, 8, '10. สัญญาฉบับนี้แต่ละข้อเป็นอิสระต่างหากจากกัน ในกรณีส่วนหนึ่งส่วนใดของสัญญาฉบับนี้ไม่สามารถใช้บังคับได้ ก็ให้สัญญาส่วนที่เหลือมีผลบังคับ', 0, 1);

$pdf->Cell(10, 8, 'ต่อกันได้ เพื่อเป็นหลักฐานแห่งการนี้จึงได้ลงลายมือชื่อไว้เนสำคัญ   ณ วัน เดือน ปี ที่ระบุด้านหน้านี้แล้ว', 0, 1);
$pdf->Ln(10);
$pdf->Cell(10, 8, ' กรมธรรม์จะมีผลคุ้มครองต่อเมื่อผู้ให้กู้ได้รับการชำระเบี้ยประกันภัยงวดแรกครบถ้วนจากผู้กู้แล้ว', 0, 1);
$pdf->Ln(15);
$pdf->Cell(10, 8, 'ลงชื่อ'  . '   ________________________________    วันที่     ' . $pay1, 0, 'J');


$pdf->Image($signaturePath, 25, 252, $imageWidth, $imageHeight, 'PNG');
$pdf->Cell(10, 7, '                  ('  . $Name . ' ' . $Lname . ')', 0, 'J');


$pdf->AddPage();
// Set font and font size
$pdf->SetXY(0, 20);
$pdf->SetFont(THSarabunNew, '', 14);
$pdf->SetXY(10, 30);
$pdf->Cell(0, 7, 'เรื่อง  ขอยกเลิกถอนกรมธรรม์ประกันภัย', 0, 1);
$pdf->Ln(7);
$pdf->Cell(0, 7, 'เรียน  ' . $callback, 0, 1);
$pdf->Ln(7);
$pdf->Cell(0, 7, 'ข้าพเจ้า  ' . $Name . ' ' . $Lname . ' มีความประสงค์', 0, 1);

$pdf->Cell(0, 7, ' ขอยกเลิก และ / หรือ ถอนกรมธรรม์ประกันภัยรถยนต์ทะเบียน : ' . $Num, 0, 1);

$pdf->Cell(0, 7, ' ทั้งกรมธรรม์ประกันรถยนต์ ประเภท 3 และ พรบ.รถยนต์', 0, 1);
$pdf->Ln(7);
$pdf->Ln(7);
$pdf->Cell(0, 7, 'ทั้งนี้  ข้าพเจ้าขอให้บริษัทประกันภัยจ่ายคืนจำนวนเงินค่าเบี้ยประกันภัยและ/หรือส่วนที่เหลือจากการยกเลิกหรือถอนกรมธรรม์ประกันภัย', 0, 1);

$pdf->Cell(0, 7, 'ให้แก่ นางสาว กุลิสรา  วงษ์เทศ โดยคืนเงินดังกล่าวข้างต้นให้ถือเสมือนหนึ่งว่าข้าพเจ้าเป็นผู้ได้รับเงินคืนเองทุกประการ  และข้าพเจ้าทราบดีว่าภายหลัง', 0, 1);

$pdf->Cell(0, 7, 'จากนี้ความคุ้มครองตามกรมธรรม์ประกันภัยดังกล่าวของข้าพเจ้าได้สิ้นสุดแล้ว หากมีความเสียหายใด ๆ เกิดขึ้น  ข้าพเจ้ารับทราบและตกลงยินยอม', 0, 1);

$pdf->Cell(10, 7, 'รับผิดชอบด้วยตนเองทุกประการ  นอกเหนือจากนี้ข้าพเจ้าขอตกลงด้วยว่าข้าพเจ้าจะไม่เรียกร้องหรือฟ้องร้องดำเนินคดีใดๆ กับบริษัทประกันภัย', 0, 1);

$pdf->Cell(10, 7, 'และ/หรือนายหน้าประกันภัย รวมทั้งผู้ที่เกี่ยวข้องอื่นใดทั้งสิ้น', 0, 1);
$pdf->Ln(7);
$pdf->Ln(7);
$pdf->Cell(10, 7, '               จึงเรียนมาเพื่อโปรดดำเนินการยกเลิกกรมธรรม์และ/หรือถอนประกันภัยตามความประสงค์ของข้าพเจ้าดังกล่าว', 0, 1);
$pdf->Ln(7);
$pdf->Ln(7);
$pdf->Ln(7);
$pdf->Ln(7);
$pdf->Cell(10, 7, '                                                       ขอแสดงความนับถือ', 0, 1);
$pdf->Ln(7);
$pdf->Ln(7);
$pdf->Cell(10, 7, '                                 ลงชื่อ'  . '   ________________________________  ', 0, 'J');
$pdf->Image($signaturePath, 60, 150 + (6 * 7), $imageWidth, $imageHeight, 'PNG');
$pdf->Cell(10, 7, '                                                       ' . $Name . ' ' . $Lname, 0, 1);
$pdf->Output('pdf_' . $name . '.pdf');
// Save the PDF file
// Database connection
$conn = connectDB();

// Generate a unique name for the PDF file
$timestamp = time();
$uniqueName = hash('sha256', uniqid('', true));

// Set the directory path to save the PDF file
$pdfContent = $pdf->Output('pdf_' . $uniqueName . '.pdf', 'S');
$pdfFilePath = 'pdf_' . $uniqueName . '.pdf';
file_put_contents($pdfFilePath, $pdfContent);

// Read the PDF file content
$binaryData = file_get_contents($pdfFilePath);

// Prepare the PDF file content for insertion into the database
$escapedData = $conn->real_escape_string($binaryData);
// Insert data into the database
$sql = "SELECT user_id FROM users WHERE full_name = '$name'";
$result = $conn->query($sql);

if ($result->num_rows > 0) {
  $row = $result->fetch_assoc();
  $user_id = $row['user_id'];
  $full_name = $Name . ' ' . $Lname; // Combine first name and last name

  if ($imageData == null) {
    $sql = "INSERT INTO installment (file_name, pdf_data, name, vehicle_plate, round, user_id) VALUES ('$uniqueName', '$escapedData', '$full_name', '$Num', '$round', '$user_id')";
  } else {
    $sql = "INSERT INTO installment (file_name, pdf_signed, name, vehicle_plate, round, user_id, status) VALUES ('$uniqueName', '$escapedData', '$full_name', '$Num', '$round', '$user_id', '1')";
  }

  if ($conn->query($sql) === TRUE) {
    echo "Data inserted successfully";
  } else {
    echo "Error: " . $sql . "<br>" . $conn->error;
  }
} else {
  echo "User not found.";
}

// Remove the temporary PDF file
unlink($pdfFilePath);


?>
